		https://docs.google.com/document/d/1dZmyGpJffIHEhBrPfzKckahKr8VtZPkuttVf_kITkTw/edit?usp=sharing
Требования заказчика.

 

Предполагается создание ИС, обслуживающей часть информационных потребностей магазина крупной торговой сети. В рамках данной системы должны быть обеспечены основные бизнес-процессы магазина (в дальнейшем будут использованы для обозначения магазина следующие сокращения ТТ или МХ), связанные с поступлением и движением товаров внутри магазина, установкой цен на данные товары, обеспечением доступа персонала к управлению данными движениями товаров и цен, предоставления справочной информации персоналу и обеспечения обмена информации между головной компанией (далее ГК) и ТТ.

До первоначального открытия ТТ происходит следующее (в случае необходимости возможно добавления атрибутов в те или иные таблицы по согласованию):

1. Передача необходимых базовых справочников из ГК на ТТ. В них входит:
a. Справочник товаров состоящий из карточек товара. Карточка товара включает в себя следующую информацию: его наименование, наименование компании производителя, страна производителя, код компании изготовителя, размеры, единицы измерения товара, технический срок годности (количество дней от даты изготовления, после которой товар считается негодным), его штрих-код, возможно дополнительная информация, см. https://infotables.ru/strany-i-goroda/8-tablitsa-tovarnyj-shtrikh-kod-proizvoditelya-stran-mira
b. Справочник сотрудников: ФИО, паспортные данные (серия, номер, адрес прописки и т.д.) для граждан РФ, для иностранных граждан см. загран. паспорт РФ, дата рождения, должность, подразделение, к которому он относится, его логин и пароль в единой системе предприятия, роль в системе, контактный рабочий и личный телефон, электронная почта и т.д.
c. Справочники должностей, ставок и количества часов выработки в месяц по должностям.
d. Справочник контрагентов-поставщиков (информация о предприятиях, с которыми заключались договора на поставку товаров)
e. Справочник контактных лиц контрагентов
f. Справочник мест хранения (информация о других магазинах, распределительных центрах, офисах головной компании)
g. Договора на поставку товаров (некоторые товары могут быть доставлены напрямую на магазин, другие поступают в распределительные центры)
h. Товары в договорах (описание количество товаров, привязанных к договорам в пункте 1.f)
i. Справочник грузовиков компании
j. Дополнительные справочники в случае необходимости
2. Прием сотрудников на работу в магазин, приблизительный состав работников с указанием приблизительных должностных обязанностей
a. Три кладовщика (https://www.audit-it.ru/terms/trud/kladovshchik.html)
b. Четыре продавца (https://mfc74.ru/interesnoe/obyazannosti-prodavtsa-konsultanta-osobennosti-professii-i-ozhidaemaya-zarplata.html)
c. Два товароведа (https://imes.su/press-tsentr/stati/item/863-tovaroved-osobennosti-professii-obyazannosti-trebovaniya-gde-uchitsya)
d. Один директор магазина (https://www.dirmagazina.ru/article/1025-obyazannosti-direktora-magazina-i-trebovaniya-k-kandidatam-na-etu-doljnost#:~:text=%D1%81%D0%B5%D0%B9%D1%87%D0%B0%D1%81%20%D0%B1%D0%B5%D1%81%D0%BF%D0%BB%D0%B0%D1%82%D0%BD%D0%BE%3E%3E%3E-,%D0%9E%D0%B1%D1%8F%D0%B7%D0%B0%D0%BD%D0%BD%D0%BE%D1%81%D1%82%D0%B8%20%D0%B4%D0%B8%D1%80%D0%B5%D0%BA%D1%82%D0%BE%D1%80%D0%B0%20%D0%BC%D0%B0%D0%B3%D0%B0%D0%B7%D0%B8%D0%BD%D0%B0,%D0%B4.)
3. Первичное заполнение внутреннего склада и торгового зала магазина. Процесс приемки имеет следующий вид:
a. Товаровед осуществляет приемку и проверку товаров (проверка на сроки годности, количество, тип товара) привозимых на магазин. В случае несоответствия каких-либо параметров отправляется запрос в ГК (с указанием причины) о решении принимать не соответствующие товары или нет. По итогу обработки запроса о приемке несоответствующего товара либо со стороны ГК либо со стороны товароведа заносится информация о поступление, либо об отказе в систему.
b. Во время исполнения запроса происходит отгрузка товара на склад, который соответствует ожидаемому приходу. В системе данный процесс отображается как приходная операция на склад по товару, кроме того регистрируется фактические сроки годности (данную работу осуществляют кладовщики).
c. После поступления товара на склад он распределяется по тем или иным складским местам, например, товары, требующие пониженную температуру, распределяются по холодильникам, другие распределяются по полкам и т.д.
d. В случае наличия места в торговом зале происходит перенос товара со складских помещений на полки, что рассматривается как расход на складе и приход в торговом зале на ту или иную полку. Возможно добавление паллет или удаление дополнительных мест в торговом зале в виде полок.
e. По согласованию директора магазина товаровед может списать тот или иной товар с указанием причин (типовые причины – форс-мажор (уничтожение товара в результате некоторой аварии), истечение срока годности товара, кража, уничтожение товара по причине халатности сотрудников (например, при переноске) или покупателем) и возможным комментарием к акту списания.
4. Кроме того перед открытием магазина проводится инвентаризация (проверка наличия тех или иных товаров) и далее повторяется раз в месяц.
5. За один день до открытия в ГК передается полный слепок базы объекта для финальных расчетов. Далее работа ведется в штатном режиме.
Утром в 08:00, до открытия магазина (до 09:00 по местному времени), директор магазина обязан запустить приказ о формировании цен на магазине. Исполнение приказа заключается в следующем:

a. выбор из набора прайс-листов (прайс-листом здесь и далее называется цена на пару МХ-товар) минимальной и установление ее на товар. Если текущая цена на товар является минимальной, то цена не меняется.
b. выбор купонов на конкретные экземпляры товара с конкретной датой истечения срока годности.
c. отдача приказа на печать ценников и купонов с указанием типа ценника (белый, желтый, акционный). Для любых прайс-листов в приказе необходимо указывать регулярную цену.
Продажа товаров в магазине невозможна без исполнения данного приказа.

Прайс-лист устанавливает цену внутри магазина на любую полку с некоторым товаром. Поступают на объект в разрезе МХ-Товар-ВХ-итоговая_цена-вид_цены. Здесь ВХ – входная цена (количество рублей, затраченных компанией, на закупку или производство данного товара + количество рублей, потраченных на доставку единицы товара на ТТ). Сами прайс-листы бывают различных видов:

1. Регулярные цена (белый ценник). Обычно наибольшая из цен.
2. Уценочная цена, формируется исходя из остатков в торговом зале и на складе по данному товару, а также информации по продажам данного товара (из чеков) в тот или иной период времени (желтый ценник). Перечисленная информация необходима ГК, поэтому требуется ее передача.
3. Акционная цена (желтый ценник). Бывают нескольких видов, подстройка под цены конкурентов, акции от поставщика и акции по всей сети, а также специальные акции “1+1”, “2+1”, “3+1” и т.д.
Рост или уменьшение цен на определенные категории товаров (детское питание, молочные смеси, хлеб и т.п.) невозможен свыше определенного процента в день (например, более 5%). В таком случае цена рассчитывается от цены за предыдущий день (на момент закрытия) плюс или минус 5%. Также стоит предусмотреть то, что на определенные группы товаров может быть установлено ограничение сверху по наценки (не более 15% от ВХ). В случае если новая минимальная цена не удовлетворяет условиям выше добавить ее в стоп-лист и передать на ГК. Предусмотреть возможность выставления данных ограничений на любые товары. Базовые значения для всех товаров 1000% наценка и 90% изменения цены. Данные значения будут уточняться со стороны ГК по мере работы магазина. Исключением из лимитов по изменению цены могут быть уценочные товары с причиной “автоуценка”. Однако, ограничение сверху по наценки товара не может быть превышено не при каких условиях.

Помимо учета товара и установки цен следует предусмотреть возможность отслеживания занятости персонала. Ставка на любую должность предполагается выставить равной 40 часам в рабочую неделю со штатным расписанием (в какие дни должен присутствовать работник, а в какие нет) из некоторого шаблона. Раз в неделю директору магазина автоматически предоставляется отчет о переработках и недоработках в магазине по персоналу. Он обязан его подтвердить или уточнить информацию в нем (например, изменить количество часов переработки или недоработки по отдельному человеку с указанием причины, даже если работника нет в отчете). После подтверждения отчет отправляется в ГК. Момент старта работы каждого работника считается вход в систему или зарегистрированная под идентификатором данного работника операция в системе. Окончанием рабочего дня считается выход из системы. Например, если работник вошел в систему в 7:50 и вышел из нее в 17:15 (итого 8:25 часов работы плюс часовой перерыв), то система должна посчитать данный рабочий день стандартным и не добавлять его в переработки. Система не должна считать отклонение от нормы в 30 минут переработкой или недоработкой. Кроме того, если рабочий не выйдет из системы до 24:00, то система должна сформировать сообщение для пользователя о подтверждении продолжении работы. Если пользователь не дает ответа в течении 5 минут, то считается, что данный работник не имел переработок в этот день, если только их не подтвердит директор в отчете.  

Директор также может регистрировать отпуска, больничные и увольнения своих работников начиная с какой-либо даты и по некоторую (для отпуска и больничного). Отпусков не должно набираться свыше 28 календарных дней в год, однако возможен учет отпусков за предыдущие года. Больничные требуют подтверждающие документы не позднее недели после их окончания или данные дни будут считаться недоработками в рамках данного календарного месяцы.

 

Команды.

1. Ценообразование – ответственна за установку корректной цены на товары в рамках магазина.
2. Товарный учет – ответственна за движение товара внутри магазина.
3. Кадровый учет – ответственна за предоставления работникам доступа к определенным частям системы и за учет отработок кадров.